import Image2 from "../../public/images/n3FxoNjdlwSzOm.gif";
import Image3 from "../../public/images/tTaJdXZuxjN3fl.gif";
import Image4 from "../../public/images/IWxPySm8vh8xwI.gif"

export const clearExercises = [
    {
        "bodyPart": "waist",
        "equipment": "وزن الجسم",
        "gifUrl": Image2,
        "id": "0001",
        "name": "تمارين الجلوس الثلاثية الربع",
        "target": "abs",
        "secondaryMuscles": [
            "عضلات الفخذين القابضة",
            "الظهر السفلي"
        ],
        "instructions": [
            "استلقِ على ظهرك مع ثني الركبتين ووضع القدمين على الأرض",
            "ضع يديك خلف رأسك مع توجيه المرفقين للخارج",
            "باستخدام عضلات بطنك، ارفع الجزء العلوي من جسمك ببطء عن الأرض مع التكور للأمام حتى يصدر جذعك بزاوية 45 درجة",
            "اثبت للحظة عند القمة، ثم اخفض الجزء العلوي من جسمك ببطء إلى وضع البداية",
            "كرر التمرين للعدد المطلوب من المرات"
        ]
    },
    {
        "bodyPart": "chest",
        "equipment": "آلة النفوذ",
        "gifUrl": Image3,
        "id": "0009",
        "name": "غطسة الصدر بمساعدة (الركوع)",
        "target": "pectorals",
        "secondaryMuscles": [
            "العضلة ثلاثية الرؤوس",
            "الأكتاف"
        ],
        "instructions": [
            "اضبط الآلة على الارتفاع المطلوب وثبّت ركبتيك على الوسادة",
            "أمسك المقابض مع توجيه راحتي اليدين للأسف وذراعيك ممدودتين بالكامل",
            "اخفض جسمك عن طريق ثني المرفقين حتى تصبح العضد العلوية موازية للأرض",
            "اثبت للحظة، ثم ادفع نفسك للأعلى إلى وضع البداية",
            "كرر التمرين للعدد المطلوب من المرات"
        ]
    },
    {
        "bodyPart": "shoulders",
        "equipment": "قضيب حديد",
        "gifUrl": Image4,
        "id": "0041",
        "name": "الرفعة الأمامية بقضيب الحديد",
        "target": "delts",
        "secondaryMuscles": [
            "بايسبس",
            "تراي"
        ],
        "instructions": [
            "قف مع مباعدة القدمين بعرض الكتفين وأمسك القضيب أمام فخذيك بقبضة علوية.",
            "ارفعه أماميًا حتى مستوى الكتفين مع إبقاء الذراعين مستقيمتين.",
            "توقف للحظة في الأعلى، ثم أنزله ببطء.",
            "كرر للعدد المطلوب."
        ]
    },
]